# დავალება 4: ახალი ელემენტის ჩამატება კორტეჟში
# პირობა:
# მოცემული გაქვს კორტეჟი, რომელიც შეიცავს კვირის სამუშაო დღეებს: work_days = ("ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი").
# შენი მიზანია, ამ კორტეჟში ჩაამატო გამოტოვებული დღე — "პარასკევი".
# რადგან კორტეჟს .append() მეთოდი არ აქვს და მასში პირდაპირ ვერაფერს ჩაწერ, გამოიყენე ტიპის კონვერტაცია (გადაიყვანე სიაში, ჩაამატე ელემენტი და დააბრუნე კორტეჟში.


work_days = ("ორშაბათი", "სამშაბათი", "ოთხშაბათი", "ხუთშაბათი")

list_wd = list(work_days)

list_wd.append('პარასკევი')

work_days = tuple(list_wd)

print(work_days)