# 1) შექმენით ცვლადი და შეინახეთ მასში სწორი პაროლი (მაგ: python123), შემდგომ შემოატანინეთ
#  მომხმარებელს პაროლი და თუ მომხმარებელი შემოიტანს არასოწრი პაროლს კიდევ ერთხელ
#  მოსთხოვეთ პაროლი (და ასე უსასრულოდ), თუ შემოიყვანს სწორ პაროლს მაშინ გამოუტანეთ ტერმინალში "Access Granted"



correct_password = "python123"

while True:
   
    user_input = input("გთხოვთ, შეიყვანოთ პაროლი: ")
    
    if user_input == correct_password:
        print("Access Granted")

        break 
    
    else:
        print("პაროლი არასწორია. სცადეთ თავიდან.")


