# 5) შექმენით პროდუქტების შესახებ CLI (Command line interface), როდესაც გაეშვება პროგრამა ტერმინალში გამოვიდეს მსგავსი რაღაცა:
# [პროდუცტების სია]
# 1. პროდუქტის დამატება.
# 2. პროდუქტის წაშლა.
# 3. პროდუქტების რაოდენობის გაგება.

# თუ მომხმარებელი აირჩევს 1 - ს:
# მოსთხოვეთ პროდუქტი (input()), როდესაც პროდუქტს შეიყვანს - ეს პროდუქტი ჩაემატოს .append() ფუნქციის დახმარებით პროდუქტების სიაში.

# თუ მომხმარებელი აირჩევს 2 - ს:
# მოსთხოვეთ პროდუქტი (input()), როდესაც პროდუქტს შეიყვანს - ეს პროდუქტი წაიშალოს .remove() ფუნქციის დახმარებით პროდუქტების სიიდან.

# როდესაც მომხმარებელი აირჩევს 3 - ს:
# გამოუტანეთ მომხმარებელს პროდუქტების რაოდენობა სიაში (len()).

# თუ რაიმე სხვას შემოიყვანს გამოუტანეთ "Invalid Choice" ტერმინალში.


products = ['სტაფილო','მაკარონი']
print('პროდუქტების სია:', products)
print('1.პროდუქტის დამატება')
print('2.პროდუქტის წაშლა')
print('3.პროდუქტების რაოდენობის გაგება')

choice = input('enter your choice here (1,2,3):')

if choice =='1':
    product = input("ჩაამატეთ პროდუქტი რომ დაამატოთ:")
    products.append(product)

elif choice == '2':
    product = input('აირჩიეთ პროდუქტი რათა წაშალოთ')
    products.remove(product)

elif choice == '3':
    print('პროდუქტების რაოდენობა სიაში: [lens(products)]')

else:
    print('invalid choice')


print(products)



   
