#10) BONUS
#წონის შეფასება ასაკის მიხედვით (უბრალოდ და ლოგიკურად)
# აღწერა:
#მომხმარებელი შეიყვანს საკუთარ ასაკს და წონას.
#პროგრამამ უნდა შეაფასოს წონა ასაკის მიხედვით მარტივი ლოგიკით:

#თუ ასაკი < 10:

#წონა < 20 → "წონა დაბალია"

#წონა 20-40 → "წონა ნორმალურია"

#წონა > 40 → "წონა მაღალია"

#თუ ასაკი 10-17:

#წონა < 40 → "წონა დაბალია"

#წონა 40-65 → "წონა ნორმალურია"

#წონა > 65 → "წონა მაღალია"

#თუ ასაკი 18 ან მეტი:

#წონა < 50 → "წონა დაბალია"

#წონა 50-90 → "წონა ნორმალურია"

#წონა > 90 → "წონა მაღალია"
#წარმატებები ❤️

age=int(input("enter your age:"))
weight=int(input("enter your weight:"))

if age<10 and weight<20:
    print("წონა დაბალია")
elif age<10 and weight>=20 and weight<=40:
    print("წონა ნორმალურია")
elif age<10 and weight>40:
    print("წონა მაღალია")

if age>=10 and age<=17 and weight<40:
    print("წონა დაბალია")
elif age>=10 and age<17 and weight>=40 and weight<=60:
    print("წონა ნორმალურია")
elif age>=10 and age<=17 and weight>65:
    print("წონა მაღალია")
    
if age>=18 and weight<50:
    print("წონა დაბალია")
elif age>=18 and weight>=50 and weight<=90:
    print("წონა ნორმალურია")
elif age>=18 and weight>90:
    print("წონა მაღალია")