#7) მომხმარებელს სთხოვე შეიყვანოს თავისი ასაკი და მიუთითოს, აქვს თუ არა სტუდენტური ბარათი.
#შემდეგ:
#თუ ასაკი ნაკლებია 18-ზე ან სტუდენტური ბარათი აქვს → დაბეჭდე "დანაზოგი გაქვს!"
#თუ ასაკი 60 ან მეტია და არ აქვს ბარათი → დაბეჭდე "პენსიონერის ფასდაკლება გაქვს!"
#სხვა შემთხვევაში → "ფასდაკლება არ გეკუთვნის.

age=int(input("enter your age:"))
card=input("do yuou have student card?:")

if age>=18 and age<60 or card=="yes":
    print("დანაზოგი გაქვს")

elif age>=60 and card=="no":
    print("პენსიონერის ფასდაკლება გაქვს")

else:
    print("ფასდაკლება არგაქვს")