#9)მომხმარებელი შეიყვანს თავის ასაკს და გულის ცემას.
#პროგრამამ უნდა დაარიგოს ასეთი რჩევები:

#ასაკი < 30 და გულისცემა < 140 → "შეგიძლიათ მეტი ივარჯიშოთ"

#ასაკი ≥ 30 და გულისცემა > 170 → "დასვენება გჭირდებათ"

#სხვა შემთხვევაში → "აქტივობის დონე ნორმალურია"

age=int(input("enter your age:"))
heartbeat=input("enter your heartbeat:")

if age<=30 and heartbeat<="140":
    print("შეგიძლია მეტი ივარჯიშო")

elif age>30 and heartbeat>="170":
    print("დასვენება გჭირდებათ")

else:
    print("აქტივობის დონე ნორმალურია")